app/views/surveys/_form.html.erb

    <%= f.label :consumer_id %><br>
    <%= f.collection_select :consumer_id, Consumer.all(), :consumer_id, :email, {:include_blank => 'Please Select A Color'} %>
---
SELECT  "consumer".* FROM "consumer" WHERE "consumer"."consumer_id" = ? LIMIT 1  [["consumer_id", nil]]