app/controllers/answers_controller.rb

SELECT "answer".* FROM "answer"
---
  def index
    @answers = Answer.all