app/controllers/consumers_controller.rb

  def index
    @consumers = Consumer.all
---
SELECT "consumers".* FROM "consumers"

  def create
    @consumer = Consumer.new(consumer_params)

    respond_to do |format|
      if @consumer.save
---
INSERT INTO "consumer" ("ip_address", "email", "clave", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "consumer_id"  [["ip_address", "127.0.0.1"], ["email", "davidvanegas7@hotmail.com"], ["clave", "zlatan7"], ["created_at", "2016-04-07 04:09:07.326118"], ["updated_at", "2016-04-07 04:09:07.326118"]]

  def destroy
    @consumer.destroy
---
DELETE FROM "consumer" WHERE "consumer"."consumer_id" = ?  [["consumer_id", 1]]

    def set_consumer
      @consumer = Consumer.find(params[:id])
---
SELECT  "consumer".* FROM "consumer" WHERE "consumer"."consumer_id" = ? LIMIT 1  [["consumer_id", 2]]