app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT "survey".* FROM "survey"

  def create
    @survey = Survey.new(survey_params)

    respond_to do |format|
      if @survey.save
---
INSERT INTO "survey" ("title", "description", "consumer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "survey_id"

    def set_survey
      @survey = Survey.find(params[:id])
---
SELECT  "survey".* FROM "survey" WHERE "survey"."survey_id" = $1 LIMIT 1  [["survey_id", 1]]