app/controllers/survey_questions_controller.rb

SELECT "survey_question".* FROM "survey_question"
---
  def index
    @survey_questions = SurveyQuestion.all